# Getting Started With Pandas

# keywords: 

reindexing, overwriting the indices using lists, accessing and modiying series using indices, values and indices of a pd series, Missing data, NaN, isnull, notnull, naming of a series object, naming of series indices, inplace re_indexing using lists, dataframes and various ways of creating dataframes, loc, iloc, reindexing columns or rows, dropping entries from an axis, indexing, selection and filtering, slicing

In [187]:
%reset -f
import pandas as pd
import numpy as np

# Pandas Series

In [188]:
# A Series is a one-dimensional array-like object containing an array of data (of anyNumPy data type) 
# and an associated array of data labels, called its index. 
#The simplestSeries is formed from only an array of data:
obj = pd.Series([4, 7, -5, 3])

In [189]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [190]:
# get the indices
obj.index

RangeIndex(start=0, stop=4, step=1)

In [191]:
# get the values
obj.values

array([ 4,  7, -5,  3])

In [192]:
# We can specify the indices using the "index" keyword
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [193]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [194]:
# getting the indices of the series
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [195]:
# We can get the values using the indices (linke in Numpy)
obj2['a']

-5

In [196]:
obj2['d']=99

In [197]:
# Indexing can also be done using a list of indices
obj2[['a','b']]

a   -5
b    7
dtype: int64

In [198]:
obj2

d    99
b     7
a    -5
c     3
dtype: int64

In [199]:
# Filtering
obj2>3

d     True
b     True
a    False
c    False
dtype: bool

In [200]:
obj2[obj2>3]

d    99
b     7
dtype: int64

In [201]:
# Another way to think about a Series is as a fixed-length, ordered dict, as it is a mappingof index values to data values. 
# It can be substituted into many functions that expect adict:

'b' in obj2

True

In [202]:
'e' in obj2

False

In [203]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [204]:
obj3 = pd.Series(sdata)

In [205]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [206]:
# The dictionary keys of the Series object can be overwrtten by a list of indices

states = ['California', 'Ohio', 'Oregon', 'Texas']

In [207]:
obj4 = pd.Series(sdata, index=states)

In [208]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [209]:
# NaN is not a number, and can be referred to as 'missing'
# isnull() and notnull() can be used to detect null and not null in a series or dataframe

obj4.isnull() # or pd.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [210]:
obj4.notnull() # or pd.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [211]:
# Series automatically aligns the differently indexed data in arithmetic operations

obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [212]:
# naming of a series object
obj4.name = 'population'

# naming of series indices
obj4.index.name = 'states'

obj4

states
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [213]:
#inplace reindexing

obj.index=[10,20,30,40]

obj

10    4
20    7
30   -5
40    3
dtype: int64

# Pandas DataFrames

In [214]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = pd.DataFrame(data)

# The resulting DataFrame contains the names of the columns in the sorted order
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [215]:
# The columns can be ordered differently using a list as follows

frame = pd.DataFrame(data, columns = ['year','state','pop'])

frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [216]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'], 
                   index=['one', 'two', 'three', 'four', 'five'])

In [217]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [218]:
# Retrieval can be done using square brackets (dictionary-like) or dot operator. For example:

frame2.year

# Or
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [219]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [220]:
# Row indexing
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [221]:
frame2['debt'] = np.arange(5)

frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [222]:
# When assigning lists and arrays to a DataFrame column, their lengths must be eqal to the length of the colmn.
# Pandas series however, can be added exactly where the indices of the series match with the indices of the DataFrame

val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

frame2['debt'] = val

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [223]:
# Assigning a column that does not exist will create a new column.
# del can be used to delete a column

frame2['eastern'] = frame2['state'] == 'Ohio'

frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [224]:
del frame2['eastern']

# Index Objects

In [225]:
obj = pd.Series(range(3), index= ['a','b','c'])

obj

a    0
b    1
c    2
dtype: int64

In [226]:
frame2.index.name = 'index'
frame2.columns.name= 'columns'

frame2

columns  year   state  pop  debt
index
one      2000    Ohio  1.5   NaN
two      2001    Ohio  1.7  -1.2
three    2002    Ohio  3.6   NaN
four     2001  Nevada  2.4  -1.5
five     2002  Nevada  2.9  -1.7

# ESSENTIAL FUNCTIONALITY

In [227]:
# Reindexing
# This can be used to change the order of the indices

obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [228]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [229]:
# Reindex with fill_value

obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [230]:
# Reindex using forward fill ffill

obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [231]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],  
                  columns=['Ohio', 'Texas', 'California'])

frame

frame.reindex(columns=['Ohio','Utah','California','Texas'])

frame.reindex(['a','b','c','d'])

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [232]:
# Both reindexing can be done in one shot

# Dropping Entires from an Axis

In [233]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [234]:
new_obj = obj.drop('c')

In [235]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

# Indexing, selection and Filtering

In [236]:
# Series indexing can be done using integers and strings

obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [237]:
obj['b']

1.0

In [238]:
obj[1]

1.0

In [239]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [240]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [241]:
obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [242]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

# Slicing

In [243]:
# Slicing in Pandas Series is inclusive when using strings

obj['b':'d']

b    1.0
c    2.0
d    3.0
dtype: float64

In [244]:
obj[0:3]

a    0.0
b    1.0
c    2.0
dtype: float64

In [245]:
# Setting using these methods

obj['b':'d']=5

obj['d']= 5

In [246]:
# Slicing Pandas DataFrame
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [247]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [248]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [249]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [250]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [251]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [253]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

# loc and iloc

In [256]:
data.loc['Colorado']

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [258]:
data.loc['Colorado','three']

6

In [259]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [260]:
data.loc[['Colorado','Utah']]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11

In [261]:
data.loc[['Colorado','Utah'],['two','three']]

          two  three
Colorado    5      6
Utah        9     10

# ============================================================